export default{
    messages:'BUY TICKET NOW',
    general:{
        backtomain:'หน้าหลัก',
        back:'ย้อนกลับ',
        orText:'หรือ',
        loginTitle:'เข้าสู่ระบบ',
        loginThai:'เข้าสู่ระบบ',
        registerTitle:'สมัครสมาชิก',
    },
    mainPage:{
            firstDate:'20 มีนาคม 2021',
            Time:'The Cavalry Club 19:00 - 23:00 น.',
            buyTicket:'ซื้อบัตรเลยตอนนี้',
            countDown:'เริ่มต้นอีก',
            Day:'วัน',
            Hours:'ชั่วโมง',
            Mins:'นาที',
            Secs:'วินาที',
            aboutDes1:'CPE NIGHT 2021 เป็นงานที่จัดขึ้นเพื่อให้นักศึกษาภาควิชาวิศวกรรมคอมพิวเตอร์ อาจารย์และบุคลากร ได้มาพบปะ สังสรรค์และสร้างปฏิสัมพันธ์อันดีภายในภาควิชาวิศวกรรมคอมพิวเตอร์ นอกจากนี้ยังเป็นงานที่จะให้ทุกคนได้รำลึกถึงช่วงเวลาที่ได้อยู่ด้วยกัน และได้รู้จักกันที่ CPE',
            aboutDes2:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึงไม่จำเป็นต้องกังวลเรื่องการแต่งตัว',
            Date:'20 มีนาคม 2021',
            Schedule:'ตารางเวลา',
            Schedule1:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึงไม่จำเป็นต้องกังวลเรื่องการแต่งตัว',
            Schedule2:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึงไม่จำเป็นต้องกังวล',
            Schedule3:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึง',
            Schedule4:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับ',
            ticketDes:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึงไม่จำเป็นต้องกังวลเรื่องการแต่งตัว',
            Bts:'รถไฟฟ้า BTS',
            Bus:'รถประจำทาง BUS',
            ticketType:'ประเภทบัตร',
            Price:'ราคา',
            Ticket1:'สินค้าตัวที่1',
            ticket1Des:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหรา',
            Ticket2:'สินค้าตัวที่2',
            ticket2Des:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหรา',
            getTicket:'ซื้อบัตรที่นี้',
            souvenirDes:'โดยรูปแบบงานในปีนี้อาจจะไม่ได้หรูหราเหมือนปีที่ผ่าน ๆ มาเนื่องจากวัตถุประสงค์ของมุ่งเน้นไปที่อยากให้ทุกคนได้กลับมาเจอกันมากกว่าจึงไม่จำเป็นต้องกังวลเรื่องการแต่งตัว',
            goToShop:'ไปที่ร้านค้า',
            Q1:'งานจัดที่ไหน ?',
            A1:'ร้าน The Cavalry Club อยู่ซอยพหลโยธิน2 ซึ่งอยู่ระหว่าง สถานนีรถไฟฟ้า BTSสนามเป้า และ BTSอารีย์',
            Q2:'งานจัดขึ้นวันไหน ?',
            A2:'วันเสาร์ที่ 20 มีนาคม 2564 เราจัดงานวันเสาร์เพื่อเผื่อเวลาวันอาทิตย์ให้พี่ ๆ ที่ต้องไปทำงานวันจันทร์ได้พักผ่อนกันให้เต็มที่',
            Q3:'ใครเข้าร่วมงานได้บ้าง ?',
            A3:'นักศึกษาวิศวกรรมคอมพิวเตอร์ทุกคนตั้งแต่รุ่น 1 ถึงรุ่น 34 รวมถึงอาจารย์และบุคลากรของวิศวกรรมคอมพิวเตอร์ทุกท่าน',
            Q4:'ค่าใช้จ่ายเท่าไหร่ ?',
            A4:'สามารถซื้อบัตรเข้าร่วมงานได้ที่…. และใครที่อยากสนับสนุนกิจกรรมนักศึกษาวิศวกรรมคอมพิเตอร์สามารถร่วมซื้อของที่ระลึกในงานได้ที่นี่…',
            Q5:'ในงานมีอะไรบ้าง ?',
            A5:'ภายในงานมีอาหารบุฟเฟ่ต์ และกิจกรรมมากมาย ทั้งการแสดงจากนักศึกษาปัจจุบัน อาจารย์และบุคลากร และพื้นที่สำหรับแลกเปลี่ยนความคิดเห็นกับรุ่นพี่ศิษย์เก่า',
            Q6:'งานนี้จำเป็นต้องแต่งตัวสวยๆ ไปไหม ?',
            A6:'ไม่ต้องค่ะ ขอแค่ทุกคนแต่งตัวให้เกียติสถานที่ก็พอ เพราะเราอยากให้ทุกคนได้มาเจอกัน แต่ทางทีมงานมีรางวัลเครื่องแต่งกายยอดเยี่ยมภายในงานให้ด้วยนะคะ',
            sponsor:'ผู้สนับสนุน'
    },

    //login , register1
    // มีใช้ loginTitl , backtomain และ orText จาก General
    loginRegister:{
        forgotPass:'ลืมรหัสผ่าน ?',
        dontHaveAccount:"ท่านยังไม่ได้สมัครสมาชิก ?",
        login:'เข้าสู่ระบบ',
        registerText:'สมัครสมาชิก',
        haveAccount:'ท่านมีบัญชีอยู่แล้ว ?',
    },
    // register 2
    // มีใช้ RegiterTitle , LoginTitle และ orText จาก General
    registerSection:{
        passwordRequire:'รหัสผ่านต้องตรงตามข้อกำหนดดังนี้ :',
        atleastEight1:'มีตัวอักษร',
        atleastEight2:'8 ตัวอักษร',
        alleastupper1:'มีตัวอักษรตัวใหญ่',
        alleastupper2:'1 ตัวอักษร',
        atleastnum1:'มีตัวเลข',
        atleastnum2:'1 ตัว',
        atleastspecial1:'มีตัวอักษรพิเศษ',
        atleastspecial2:'1 ตัวอักษร',
        continueText:'ต่อไป',
        tellusyourself1:'บอกเราเพิ่มเติมหน่อย',
        tellusyourself2:'เกี่ยวกับตัวคุณ',
        back:'ย้อนกลับ',
        next:'ต่อไป'
    },

    //register 5: 
    // back , tellusyourself
    registerInformation:{
        howcontact:"เราจะติดต่อคุณได้อย่างไร ?",
        optional:'ไม่จำเป็น',
        wherework:'คุณทำงานที่ไหนเอ่ย ?',
        whatyourfirst:'บอกชื่อของคุณหน่อย ?',
        whenyourbirth:'คุณพี่เกินวันอะไรค้าาาา ?',
        whichcpe:'คุณพี่อยู่ CPE รุ่นอะไรค้าาาา ?',
        dateofbirth:'วันเกิด',
        whatdoyoudo:'คุณทำอะไร ?',
        fieldofwork:'หน้าที่ / สิ่งที่คุณทำ',
        finish:'เสร็จสิ้น'
    },

    //Account
    myAccount:{
        general:'ข้อมูลทั่วไป',
        firstname:'ชื่อจริง',
        lastname:'นามสกุล',
        nickname:'ชื่อเล่น',
        cpe:'รุ่น',
        birthDate:'วันเกิด',
        contact:'ติดต่อ',
        line:'ไลน์',
        facebook:'เฟซบุ๊ค',
        phone:'เบอร์โทรศัพท์',
        work:'หน้าที่การงาน',
        organization:'สถานที่ทำงาน',
        role:'ตำแหน่ง',
        field:'หน้าที่',
        editprofile:'แก้ไขข้อมูล',
        saveprofile:'ยืนยันข้อมูล',
        cancel:'ยกเลิก',
        myTicket:'ตั๋วของฉัน',
        myAccount:'บัญชีของฉัน',
        mainpage:'กลับหน้าหลัก',
        logout:'ออกจากระบบ',
        profile:'ข้อมูลส่วนตัว'
    },
    editPassword:{
        changePass:'เปลี่ยนรหัสผ่าน',
        currentPass:'รหัสผ่านปัจจุบัน',
        newPassword:'รหัสผ่านใหม่',
        confirmPassword:'ยืนยันรหัสผ่านใหม่'
    },

    accountType:{
        cantChangePass:'คุณไม่สามารถเปลี่ยนรหัสได้'
    },

    //navbar
    navbar:{
        home:'หน้าหลัก',
        about:'เกี่ยวกับ',
        ticket:'บัตรเข้างาน',
        souvenir:'ของที่ระลึก',
        faqs:'คำถาม',
        contact:'ติดต่อ',
        shop:'ร้านค้า',
        loginThai:'ล็อคอิน',
    },
    footer:{
        pkatname:'ปรัษฐา วีระพงษ์ (แคท)',
        ppname:'ณัฐกนก โภคทรัพย์ไพบูลย์ (ภีรย์)',
        description:'ภาควิชาวิศวกรรมคอมพิวเตอร์ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี ชั้น 10 อาคารวิศววัฒนะ 126 ถ.ประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพฯ 10140'
    }
}